import 'package:Umrah/widgets/w-prayer-group.dart';
import 'package:flutter/material.dart';

import '../classes/c-pray.dart';

class Praying extends StatefulWidget {
  @override
  _PrayingState createState() => _PrayingState();
}

class _PrayingState extends State<Praying> {
  List<Pray> prayers = [
    Pray(
      title: 'الثناء على الله',
      prays: [
        '{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (2) الرَّحْمَٰنِ الرَّحِيمِ (3) مَالِكِ يَوْمِ الدِّينِ (4) }',
        '{ الْحَمْدُ لِلّهِ الَّذِي خَلَقَ السَّمَاوَاتِ وَالأَرْضَ وَجَعَلَ الظُّلُمَاتِ وَالنُّورَ  }',
        '{ الْحَمْدُ لِلّهِ الَّذِي هَدَانَا لِهَـذَا وَمَا كُنَّا لِنَهْتَدِيَ لَوْلا أَنْ هَدَانَا اللّهُ  }',
        '{ الْحَمْدُ لِلَّهِ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ جَاعِلِ الْمَلَائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَّثْنَى وَثُلَاثَ وَرُبَاعَ يَزِيدُ فِي الْخَلْقِ مَا يَشَاء إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (1)   }',
        '{ الْحَمْدُ لِلَّهِ الَّذِي أَنزَلَ عَلَى عَبْدِهِ الْكِتَابَ وَلَمْ يَجْعَل لَّهُ عِوَجَا (1) }',
        '{ هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ  (22) هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ (23) هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاء الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (24)  }',
        '{ الْحَمْدُ لِلَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَلَهُ الْحَمْدُ فِي الْآخِرَةِ وَهُوَ الْحَكِيمُ الْخَبِيرُ (1) }',
        '{ الْحَمْدُ لِلّهِ الَّذِي لَمْ يَتَّخِذْ وَلَدًا وَلَم يَكُن لَّهُ شَرِيكٌ فِي الْمُلْكِ وَلَمْ يَكُن لَّهُ وَلِيٌّ مِّنَ الذُّلَّ وَكَبِّرْهُ تَكْبِيرًا (111)  }',
        '«اللَّهُمَّ لَكَ الحَمْدُ أَنْتَ نُورُ السَّمَاوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الحَمْدُ أَنْتَ قَيِّمُ السَّمَاوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الحَمْدُ أَنْتَ مَلِكُ السَّمَاوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الحَمْدُ أَنْتَ الحَقُّ، وَوَعْدُكَ الحَقُّ، وَقَوْلُكَ حَقٌّ، وَلِقَاؤُكَ حَقٌّ، وَالجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالسَّاعَةُ حَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمُحَمَّدٌ حَقٌّ، اللَّهُمَّ لَكَ أَسْلَمْتُ، وَعَليْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ، أَنْتَ رَبُّنَا وَإِليْكَ المَصِيرُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، أَنْتَ إِلَهِي، لَا إِلَهَ إِلَّا أَنْتَ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِكَ».',
        '«اللَّهُمَّ ربَّنَا لَكَ الحَمْدُ، مِلْءَ السَّمَاوَات وَمِلْءَ الأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، أَهْلَ الثَّنَاءِ وَالمَجْدِ، أَحَقُّ مَا قَالَ العَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ، لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ».',
        '«اللَّهُمَّ لَكَ الحَمْدُ كُلُّهُ، وَإِليْك يُرْجَعُ الأَمْرُ كُلُّهُ».',
        '«الحَمْدُ لِلَّهِ، حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ، كَمَا يُحِبُّ رَبُّنَا وَيَرْضَى».',
        '«الحَمْدُ لِلَّهِ كَثِيراً، اللَّهُ أَكْبَرُ كَبِيراً».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ الذَّي لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ الذَّي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدَ، لَا إِلَهَ إِلَّا أَنْتَ، المَنَّانُ، يَا بَدِيعَ السَّمَاوَات وَالأَرْضِ، يَا ذَا الجَلَالِ وَالإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ».',
        '«اللَّهُمَّ إِنِّي أُشْهِدُكَ، وَأُشْهِدُ مَلَائِكَتَك وحَمَلَةَ عَرْشِكَ، وَأُشْهِدُ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الأَرْضِ ؛ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ».',
        '«لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ ، وَالحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّه أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ العَلِيِّ العَظَيمِ».',
        '«لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ، لَا إِلَـهَ إِلَّا اللَّـهُ وَحْـدَهُ، لَا إِلَهَ إِلَّا اللَّهُ لَا شَرِيكَ لَهُ، لَا إِلَهَ إِلَّا اللَّهُ لَهُ المُلْكُ وَلَهُ الحَمْدُ، لَا إِلَـهَ إِلَّا اللَّـهُ ولَا حَـوْلَ وَلَا قُـوَّةَ إِلَّا بِـاللَّـهِ».',
        '«الحَمْدُ لِلَّهِ عَدَدَ مَا خَلَقَ، وَالحَمْدُ لِلَّهِ مِلْءَ مَا خَلَقَ، وَالحَمْدُ لِلَّهِ عَدَدَ مَا فِي الأَرْضِ وَالسَّمَاءِ، وَالحَمْدُ لِلَّهِ مِلْءَ مَا فِي الأَرْضِ وَالسَّمَاء، وَالحَمْدُ لِلَّهِ عَدَدَ مَا أَحْصَى كِتَابُهُ، وَالحَمْدُ لِلَّهِ مِلْءَ مَا أَحْصَى كِتَابُهُ، وَالحَمْدُ لِلَّهِ عَدَدَ كُلِّ شَيْءٍ، وَالحَمْدُ لِلَّهِ مِلْءَ كُلِّ شَيْءٍ.',
        'سُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ، سُبْحَانَ اللَّهِ مِلْءَ مَا خَلَقَ، سُبْحَانَ اللَّهِ عَدَدَ مَا فِي الأَرْضِ وَالسَّمَاءِ، سُبْحَانَ اللَّهِ مِلْءَ مَا فِي الأَرْضِ وَالسَّمَاءِ، سُبْحَانَ اللَّهِ عَدَدَ مَا أَحْصَى كِتَابُهُ، سُبْحَانَ اللَّهِ مِلْءَ مَا أَحْصَى كِتَابُهُ، سُبْحَانَ اللَّهِ عَدَدَ كُلِّ شَيْءٍ، سُبْحَانَ اللَّهِ مِلْءَ كُلِّ شَيْءٍ».',
        '«سُبْحَانَكَ، مَا أَعْظَمََكَ رَبَّنَا».',
        '«سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ».',
        '«اللَّهُ أَكْبَرُ كَبِيراً، وَالحَمْدُ لِلَّهِ كَثِيرِاً، وَسُبْحَانَ اللَّهِ بُكْرةً وَأَصِيلاً».',
        '«اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَبِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَليْكَ؛ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ».',
        '«لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، اللَّهُ أَكْبَرُ كَبِيراً، وَالحَمْدُ لِلَّهِ كَثِيراً، سُبْحَانَ اللَّهِ رَبِّ العَالَمِينَ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهَ العَلِيِّ العَظِيمِ العَزِيزِ الحَكِيمِ».',
        '«لَا إِلَهَ إِلَّا اللَّهُ وَحْدهُ، أَعَزَّ جُنْدَهُ، وَنَصَرَ عَبْدَهُ، وَغَلَبَ الأَحْزَابَ وَحْدَهُ، فَلَا شَيْءَ بَعْدَهُ».',
        '«سُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَسُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَسُبْحَانَ اللَّهِ عَدَدَ مَا بَيْنَ ذَلِكَ، وَسُبْحَانَ اللَّهِ عَدَدَ مَا هُوَ خَالِقٌ.',
        'اللَّهُ أَكْبَرُ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَاللَّهُ أَكْبَرُ عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَاللَّهُ أَكْبَرُ عَدَدَ مَا بَيْنَ ذَلِكَ، وَاللَّهُ أَكْبَرُ عَدَدَ مَا هُوَ خَالِقٌ.',
        'الحَمْدُ لِلَّهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَالحَمْدُ لِلَّهِ عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَالحَمْدُ لِلَّهِ عَدَدَ مَا بَيْنَ ذَلِكَ، وَالحَمْدُ لِلَّهِ عَدَدَ مَا هُوَ خَالِقٌ.',
        'لَا إِلَهَ إِلَّا اللَّهُ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَلَا إِلَهَ إِلَّا اللَّهُ عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَلَا إِلَهَ إِلَّا اللَّهُ عَدَدَ مَا بَيْنَ ذَلِكَ، وَلَا إِلَهَ إِلَّا اللَّهُ عَدَدَ مَا هُوَ خَالِقٌ.',
        'لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ. وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ عَدَدَ مَا خَلَقَ فِي الأَرْضِ.وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ عَدَدَ مَا بَيْنَ ذَلِكَ.وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ عَدَدَ مَا هُوَ خَالِقٌ».',
        'سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ ❋ وَسَلَامٌ عَلَى الْمُرْسَلِينَ ❋  وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ❋❋❋',

      ],
      isExpanded: false,
    ),
    Pray(
      title: 'الصلاة على النبي ',
      prays: [
        'اللهم صلي وسلم على سيدنا ونبينا محمد ',
        ' صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد',
        '«اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ».',
        '«اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى أَهْلِ بَيْتِهِ، وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْت عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى أَهْلِ بَيْتِهِ، وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ».',
        '«اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ النَّبِيّ الأُمِيِّ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ النَّبِيِّ الأُمِيِّ ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي العَالَمِينَ، إِنَّكَ حَمِيدٌ مَجِيدٌ».',
        '«اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ وَبَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ».',
        '«اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّد عَبْدِكَ وَرَسُولِكَ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهيمَ، وَعَلَى آلِ إِبْرَاهِيمَ».',
        '«اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ».',
        'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى نَبِيِّنَا مُحَمَّدٍ صلى الله عليه وسلم.',
      ],
      isExpanded: false,
    ),
    Pray(
      title: 'الاستغفار',
      prays: [
        '{ رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ }',
        '{ رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ (41) }',
        '{ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ }',
        '{ رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ (193) رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ (194) }',
        '{ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَؤُوفٌ رَّحِيمٌ (10) }',
        '{ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ }',
        '{ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ }',
        '{ ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ }',
        '{ رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ }',
        '{ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي }',
        '{ رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ  }',
        '«وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ المُشْرِكِينَ، إِنَّ صَلَاتِي، وَنُسُكِي، وَمَحْيَايَ، وَمَمَاتِي، للَّهِ رَبِّ العَالَمِينَ، لَا شَرِيكَ لَهُ؛ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ المُسْلِمِينَ. اللَّهُمَّ أَنْتَ المَلِكُ لَا إِلَهَ إِلَّا أَنْتَ. أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي، فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً، إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، وَاهْدِنِي لِأَحْسَنِ الأَخْلَاقِ، لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ، وَاصْرِف عَنِّي سَيِّئَهَا، لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالخَيْرُ كُلُّهُ فِي يَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ، الأَحْدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ».',
        '«اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ».',
        '«اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ».',
        '«اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالخَطَايَا، اللَّهُمَّ نَقِّنِي مِنْهَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ طَهِّرَنِي بِالثَّلْجِ وَالبَرَدِ وَالمَاءِ البَارِدِ».',
        '«اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي فِي دَارِي، وَبَارِكْ لِي فِيمَا رَزَقْتَنِي».',
        '«اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَخَطَايَايَ كُلَّهَا، اللَّهُمَّ أَنْعِشْنِي، وَاجْبُرْنِي وَاهْدِنِي لِصَالِحِ الأَعْمَالِ وَالأَخْلَاقِ، فَإِنَّهُ لَا يَهْدِي لِصَالِحِهَا، وَلَا يَصْرِفُ سَيِّئَهَا، إِلَّا أَنْتَ».',
        '«اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاجْبُرْنِي، وَارْفَعْنِي، وَاهْدِنِي وَعَافِنِي، وَارْزُقْنِي».',
        '«اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَأَخْسِئْ شَيْطَانِي، وَفُكَّ رِهَانِي، وَثقِّلْ مِيزَانِي، وَاجْعَلْنِي فِي النَّدِيِّ الأَعْلَى».',
        '«اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلَانِيَتَهُ وَسِرَّهُ».',
        '«اللَّهُمَّ اغْفِرْ لِي مَا أَخْطَأْتُ وَمَا تَعَمَّدتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا جَهِلْتُ وَمَا عَلِمْتُ».',
        '«اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَخَطَئِي، وَعَمْدِي».',
        '«اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْت، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، لَا إِلَهَ إِلَّا أَنْتَ».',
        '«اللَّهُمَّ أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي، يَا رَبِّ فَاغْفِرْ لِي ذَنْبِي، إِنَّكَ أَنْتَ رَبِّي، إِنَّهُ لَا يَغْفرُ الذَّنْبَ إِلَّا أَنْتَ».',
        '«اللَّهُمَّ اغْفِرْ لِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ».',
        '«اللَّهُمَّ اغْفِرْ ذَنْبِي، وَطَهِّرْ قَلْبِي، وَحَصِّنْ فَرْجِي».',
        '«رَبِّ اغْفِرْ لِي خَطِيئَتِي يَوْمَ الدِّينِ».',
        '«رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَوَّابُ الرَّحِيمُ».',
        '«أَسْتَغْفِرُ اللَّهَ العَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الحَيُّ القَيُّومُ، وَأَتُوبُ إِليْهِ».',
        '«سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَك اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ».',
        '«سُبْحَانَ اللَّهِ، وَالحَمْدُ للَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ».',
        '«سُبْحَانَ اللَّهِ، وَالحَمْدُ للَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، اللَّهُمَّ اغْفِرْ لِي، اللَّهُمَّ ارْحَمْنِي، اللَّهُمَّ ارْزُقْنِي».',
        '«سُبْحَانَ اللَّهِ وَبِِِِِحَمْدِهِ».',
        '«لَا إِلَهَ إِلَّا اللَّهُ الحَلِيمُ الكَرِيمُ، لَا إِلَهَ إِلَّا اللَّهُ العَلِيُّ العَظِيمُ، سُبْحَانَ اللَّهِ رَبِّ السَّمَاوَاتِ السَّبْعِ وَرَبِّ العَرْشِ العَظِيمِ، الحَمْدُ للَّهِ رَبِّ العَالَمِينَ».',
        
      ],
      isExpanded: false,
    ),
    Pray(
      title: 'السؤالات',
      prays: [
        '{ رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ  }',
        '{ وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ }',
        '{ رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ (40) }',
        '{ رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ (83) وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآَخِرِينَ (84) وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ (85) }',
        '{ وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ (87) }',
        '{ رَبِّ زِدْنِي عِلْمًا }',
        '{ رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ (8) }',
        '{ رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ }',
        '{ رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ }',
        '{ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ }',
        '«اللَّهُمَّ لَكَ الحَمْدُ كُلُّهُ، اللَّهُمَّ لَا قَابِضَ لِمَا بََسَطْتَ، وَلَا بَاسِطَ لِمَا قَبَضْتَ، وَلَا هَادِيَ لِمَنْ أَضْلَلْتَ، وَلَا مُضِلَّ لِمَنْ هَدَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُقَرِّبَ لِمَا بَاعَدْتَ، وَلَا مُبَاعِدَ لِمَا قَرَّبْتَ، اللَّهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ المُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ العَيْلَةِ، وَالأَمْنَ يَوْمَ الخَوْفِ، اللَّهُمَّ إِنِّي عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا، وَشَرِّ مَا مَنَعْتَنَا، اللَّهُمَّ حَبِّبْ إِلَيْنَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ، اللَّهُم توَفَّنَا مُسْلِمِينَ، وَأَحْيِنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلَا مَفْتُونِينَ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ وَيَصُدُّونَ عَنْ سَبِيلِكَ، وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ أُوتُوا الكِتَابَ؛ إِلَهَ الحَقِّ».',
        '{ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا }',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ بَأَنَّ لَكَ الحَمْدُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، المَنَّانُ، يَا بَدِيعَ السَّمَاوَاتِ وَالأَرْضِ، يَا ذَا الجَلَالِ وَالإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ، إِنِّي أَسْأَلُكَ الجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ».',
        '«اللَّهُمَّ أَصْلِحْ لِي دِينِي، وَوَسِّعْ عَلَيَّ فِي ذَاتِي، وَبَارِكْ لِي فِي رِزْقِي».',
        '«اللَّهُمَّ بِعِلْمِكَ الغَيْبَ، وَقُدْرَتِكَ عَلَى الخَلْقِ، أَحْيِنِي مَا عَلِمْتَ الحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا كَانَتِ الوَفَاةُ خَيْراً لِي، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الغَيْبِ وَالشَّهَادَةِ، وأَسْأَلُكَ كَلِمَةَ الحَقِّ وَالعَدْلِ فِي الغَضَبِ وَالرِّضَى، وَأَسْأَلُكَ القَصْدَ فِي الفَقْرِ وَالغِنَى، وَأَسْأَلُكَ نَعِيماً لَا يَبِيدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْفَدُ وَلَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَى بَعْدَ القَضَاءِ، وَأَسْأَلُكَ بَرْدَ العَيْشِ بَعْدَ المَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلى وَجْهِكَ، وَأَسْأَلُكَ الشَّوْقَ إِلَى لِقَائِكَ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلنَا هُدَاةً مُهْتَدِينَ».',
        '«اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَة لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَأَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ الفِرْدَوْسَ الأَعْلَى مِنَ الجَنَّةِ».',
        '«اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ، اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ، اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ».',
        'اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ المُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ».',
        '«اللَّهُمَّ حَاسِبْنِي حِسَاباً يَسِيراً».',
        '«اللَّهُمَّ أَحْيِنِي مِسْكِيناً، وَأَمِتْنِي مِسْكِيناً، وَاحْشُرْنِي فِي زُمْرَةِ المَسَاكِينِ يَوْمَ القِيَامَةِ».',
        '«اللَّهُمَّ احْفَظْنِي بِالإِسْلَامِ قَائِماً، وَاحْفَظْنِي بِالإِسْلَامِ قَاعِداً، وَاحْفَظْنِي بِالإِسْلَامِ رَاقِداً، وَلَا تُشْمِتْ بِي عَدُوّاً حَاسِداً، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ، وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُه بِيَدِكَ».',
        '«اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ اليَقِينَ وَالمُعَافَاة».',
        '«اللَّهُمَّ جَدِّدِ الإِيمَانَ فِي قُلُوبِنَا».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى وَالتُّقَى، وَالعَفَافَ وَالغِنَى».',
        '«اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهَا إِلَّا أَنْتَ».',
        '«اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي».',
        '«اللَّهُمَّ آتِنِي أَفْضَلَ مَا تُؤْتِي عِبَادَكَ الصَّالِحِينَ».',
        '«اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ».',
        '«اللَّهُمَّ يَا مُقَلِّبَ القُلُوبِ، ثَبِّتْ قَلْبِي عَلَى دِينِكَ».',
        '«اللَّهُمَّ هَبِ المُسِيئِينَ مِنَّا لِلْمُحْسنِينَ، وَأَعْطِ مُحْسِنَنَا مَا سَأَلَ».',
        '«اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا، وَأَبْصَارِنَا، وَقُوَّتنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلَا تَجْعَلْ مُصِيبَتَنَا فِي دِيِنِنَا، وَلَا تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّناَ، وَلَا مَبْلَغَ عِلْمِنَا، وَلَا تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا».',
      ],
      isExpanded: false,
    ),
  ];

  toggleExpansion(int index) {
    if (index < 0 || index > prayers.length) return;
    setState(() {
      this.prayers[index].isExpanded = !this.prayers[index].isExpanded;
    });
  }

  @override
  Widget build(BuildContext context) {
    return SingleChildScrollView(
      child: Column(
        crossAxisAlignment: CrossAxisAlignment.start,
        children: prayers.map((pray) {
          var index = prayers.indexOf(pray);
          return PrayerGroup(
            pray: pray,
            index: index,
            toggleExpansion: toggleExpansion,
          );
        }).toList(),
      ),
    );
  }
}
